OpenFOAM-v1712/tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh
runApplication $(getApplication)
runApplication -s sample  postProcess -latestTime -func sample

runApplication validation/createGraphs

#------------------------------------------------------------------------------
